{
	"title" : "Towards fast and accurate exascale quantum-mechanical calculations for material modelling using finite-element discretization and mixed-precision arithmetic",
	"photo_link" : "resources/images/faculty_speakers/phanim_cds.jpeg",
	"speaker_link": "https://cds.iisc.ac.in/people/faculty/name/phani-motamarri/",
	"speaker" : "Phani Motamarri",
	"abstract" : "Quantum mechanical modelling of materials based on density functional theory (DFT) have been instrumental in providing crucial insights into materials behaviour and occupy a significant fraction of computational resources in the world today. However, the asymptotic cubic-scaling computational complexity of the underlying DFT eigenvalue problem and the stringent accuracy requirements in DFT, demand massive computational resources for accurate prediction of meaningful material properties. Thus, these calculations are routinely limited to material systems with at most a few thousands of electrons, employing plane-wave discretization despite all its limitations which has remained the method of choice for many materials science applications. In this talk, I will present some recent advances made in the state-of-the-art for accurate quantum-mechanical calculations using density functional theory (DFT) -via- the development of DFT-FE, employing adaptive finite-element discretization, in conjunction with mixed-precision strategies for the solution of governing equations alongside with implementation innovations focusing on significantly reducing the data movement costs and increasing arithmetic intensity on hybrid CPU-GPU architectures. The reported advance discussed in this talk has wide ranging implications in tackling critical scientific and technological problems by making use of the predictive capability of DFT calculations for large-scale material systems.",
	"bio" : "Dr. Phani Motamarri is currently an Assistant Professor at the Department of Computational and Data Sciences, IISc-Bangalore. Prior to this, he was a research faculty member at the University of Michigan, Ann Arbor, USA from where he received his PhD in the area of Computational Materials Physics from the Department of Mechanical Engineering. His primary research interests include development of mathematical techniques and HPC centric real-space computational algorithms that can leverage the latest heterogeneous parallel computing architectures and upcoming exa-scale machines for quantum-mechanical material modeling and furthermore, harnessing these computational capabilities to address complex materials science problems. He is one of the lead developers of DFT-FE --- an open-source computational framework for massively parallel large-scale density functional theory calculations that was named as a finalist for 2019 ACM Gordon Bell Prize, the prestigious prize in scientific computing."
}

