{
	"title" : "Gallium Nitride (GaN): the gift that keeps on giving",
	"photo_link" : "resources/images/plenary_speakers/umesh-mishra.jpg",
	"speaker_link": "https://engineering.ucsb.edu/people/umesh-mishra",
	"speaker" : "Umesh Mishra",
	"abstract" : "GaN has changed the world we live in. In photonics GaN-based LED lighting has replaced filament lights and fluorescent lamps (the ubiquitous tube light), large area displays are powered by green and blue GaN based LEDs, traffic lights are LED based, headlights in cars are GaN-based, smart phones have GaN LED based backlit displays and GaN-based lasers are emerging in recording, display and lighting applications. In electronics, military RADAR is now transitioning to being powered by GaN as are all 5G base stations. In power conversion, Titanium class power supplies demand GaN as do compact adapters for notebooks and smartphones. GaN is being designed into EV chargers and on-board DC/DC converters and will challenge Silicon Carbide in even traction applications. <br><br>Hang on the for the ride…",
	"bio" : "Umesh Mishra received his B.Tech. from IIT Kanpur in 1979, M.S. in EE from Lehigh University in 1980 and his PhD from Cornell University in 1984. He has taught at the University of Michigan and NC State University and worked at GE and Hughes Research Laboratories before his tenure at UC Santa Barbara where he has been since 1990. He is currently a Distinguished Professor of the University of California. Umesh is also a Member of the National Academy of Engineering of the USA, Fellow of the IEEE, International Fellow of the Japanese Society of Applied Physics and the National Academy of Inventors. He has received the IEEE David Sarnoff Award and the Welker Medal from the ISCS. He has graduated over 70 PhD students with over 45 in the area of GaN. He has co-founded two companies, Nitres (1996), the first start up in the world to commercialize GaN based LEDS and RF transistors (acquired by CREE in 2000) and Transphorm (2017:TGAN) to commercialize GaN based power conversion. 5 of his students have co-founded companies. He was a member of the international committee that reviewed the Division of EECS in October 2017."
}