{
	"title" : "Proportional Fair Downlink NOMA; from a centralized analysis to practical schemes",
	"photo_link" : "photos/15._Catherine_Rosenberg.jpg",
	"speaker_link": "https://uwaterloo.ca/scholar/cath",
	"speaker" : "Catherine Rosenberg",
	"abstract" : "We investigate the performance of a Non-Orthogonal Multiple Access (NOMA) multi-cell downlink system by formulating and solving a centralized scheduling problem that jointly performs,  on a resource block basis, user selection, power allocation, Modulation and Coding Scheme (MCS) selection to optimize a proportional fair objective over a frame, assuming perfect channel information. While such a fully coordinated scheduling  is practically infeasible, it provides an upper bound on the performance of practical schemes.<br>The results indicate that although NOMA with 2 multiplexed users can bring significant gain over a traditional Orthogonal Multiple Access (OMA) system, the gain of NOMA with 3 users over NOMA with 2 users is marginal. Additionally, results show that a simple equal power allocation scheme (often used in the literature) performs poorly when compared to the case with optimal centralized power allocation that can serve as a (highly complex) power coordination scheme.  Thus, we propose a simple static coordinated power allocation scheme for NOMA using a power map that can be easily parameterized and calibrated offline in the planning phase. The power map scheme performs only 15% worse than the upper bound.<br>We then propose a simple practical heuristic for NOMA scheduling. The suggested method sacrifices a maximum  of 10% performance with respect to the optimal user scheduler and reduces the computation time by a factor of 45. <br>This work was done in collaboration with Abdalla Hussein and Prof. Patrick Mitran.",
	"bio" : "Catherine Rosenberg is a Professor in Electrical and Computer Engineering at the University of Waterloo since 2004. Since June 2010, she holds the  Canada Research Chair in the Future Internet. In April 2018, she became the Cisco Research Chair in 5G Systems. She was elected an IEEE Fellow for contributions to resource management in wireless and satellite networks in 2011 and was elected a Fellow of the Canadian Academy of Engineering in 2013.  Her research expertise lies in wireless networks, multimedia, traffic engineering and energy systems."
}

