{
	"title" : "AI and Hybrid Cloud",
	"photo_link" : "https://researcher.watson.ibm.com/researcher/photos/4641.jpg",
	"speaker_link": "https://researcher.watson.ibm.com/researcher/view.php?person=in-asinghee",
	"speaker" : "Amith Singhee ",
	"abstract" : "When organizations looks to adopt cloud computing technology at scale for their enterprise applications, they are faced with substantial challenges. Having a public cloud available for use is nowhere near sufficient for actually adopting cloud computing for core business applications that power businesses and organizations today. We will look at some of these challenges and introduce the concept of Hybrid Cloud that makes cloud computing more practical. We will then see how innovations in the application of artificial intelligence to 'machine language' are enabling the adoption of cloud computing on such Hybrid Clouds.",
	"bio" : "Dr. Amith Singhee is a Senior Manager and Senior Technical Staff Member at IBM Research, India. He leads the Hybrid Cloud research mission for IBM India, where he is responsible for developing innovations that help IBM’s enterprise clients to effectively adopt Hybrid Cloud. From 2008 to 2015, he was with the IBM T. J. Watson Research Center in NY, USA. He has extensive experience in applying artificial intelligence, IoT, enterprise architecture, Cloud and mobile to real-world business processes with large enterprises globally and across multiple sectors such as retail, energy, agriculture, buildings and chip design. This work has led to multiple new product offerings from IBM. Dr. Singhee has a PhD in Electrical and Computer Engineering from Carnegie Mellon University. He is a winner of several awards, specifically the highest technical award at IBM, the Donald O. Pederson award from IEEE/CEDA, the Outstanding Dissertation Award from EDAA, the Arthur G. Milnes Award from Carnegie Mellon University, and best paper awards at top Power and EDA conferences, such as IEEE PES General Meeting, DAC, DATE and VLSI Design. He is a Senior Member of the IEEE and a member of the ACM."
}

