{
	"title" : "Cognitive Network Management in Mobile Cyber-Physical Systems",
	"photo_link" : "http://sanneck.net/sanneck.jpg",
	"speaker_link": "http://sanneck.net/",
	"speaker" : "Henning Sanneck ",
	"abstract" : "In 5G, new service types (critical and massive Machine Type Communications) have been introduced addressing the needs of Mobile Cyber-Physical Systems. New network capabilities like beamforming and multi-connectivity are realized within a virtualized, sliced mobile network. This leads to additional operational complexity, e.g., with regard to jointly optimizing physical and virtual resources and perform intra- and inter-slice management. To address such operational complexity, we argue that a Network Management System needs to be “Autonomous” and 'Cognitive', i.e., being able to conceptualize and contextualize itself and its cyber-physical environment. The increased availability of network and context data together with the identification of suitable AI methods allows to create Cognitive Network Management functions for 5G operational use cases. As a case study for the described characteristics, we show 'Predictive Location-Aware Network Automation for Radio (PLANAR)' enabling coverage & capacity prediction in the digital twin of a sliced 5G outdoor trial campus network (Hamburg seaport) and give an outlook towards similar systems in indoor environments (manufacturing plants). In summary, Cognitive (AI-enabled) Network Management functions allow to handle network infrastructure complexity and optimize performance. From the perspective of the human network operator the focus shifts from participating in the execution workflow of network operations to supervising that workflow.",
	"bio" : "Henning Sanneck heads the “Network Automation” Research Department in the Standards unit of Nokia Strategy & Technology, Munich, Germany. He received his Dr.-Ing. (PhD) degree in Electrical Engineering from the Technical University of Berlin with a thesis on Voice over IP QoS in 2000. Then, Henning joined Siemens - Mobile Networks as a Senior Research Engineer, becoming an Innovation Project Manager in Radio Network Management in 2003. In 2007, at the formation of Nokia Siemens Networks, he started to lead a line team driving Self Organizing Networks (SON) concepts, IPR and demos for LTE using policy-based management technologies. Since 2009, Henning and his team are working on applying and adapting analytics and machine learning technologies to Radio Network Management (in particular for anomaly detection and diagnosis) using network data- and simulation-based approaches. In 2014/15, as 'Head of Cognitive Network Management' for Nokia Networks Research, he has also acted as the coordinator of the research & standardization work in that technical area which included the strategy development and technology transfer supervision. Henning’s team has been continuously involved in nationally (BMBF) and internationally (EU) funded research projects. His current research interests are in (Beyond) 5G Network Management and Orchestration, in particular configuration, healing and the operation of Cognitive Functions in virtualized, sliced radio access networks (across public and private deployment scenarios). Henning has published 80 papers and has 30 patents granted or published. He has been co-editor and author of the book 'LTE Self-Organizing Networks' (2011) and co-author of the book 'Towards Cognitive Autonomous Networks' (2020)."
}