{
	"title" : "Integrated Sensor Systems",
	"photo_link" : "resources/images/faculty_speakers/arup_ese.jpg",
	"speaker_link": "talk.php?id=5",
	"speaker" : "Arup Polley",
	"abstract" : "There is an ever-increasing demand of lower cost, lower power and higher performance sensor systems with small form factor. Sensor ASICs play a critical role in converting a sensor concept to a sensor solution that caters to these requirements. In the talk, an integrated Hall-effect sensor system will be presented that enables accurate, wide-band non-contact current sensing. Sensors in the non-CMOS platforms can also benefit from the signal processing schemes that can be effectively implemented using CMOS ASICs. Graphene and two-dimensional materials in general are sensor wonderland. However, typical graphene field effect devices suffer from low frequency noise that limits the sensor performance. A gate modulation technique that utilizes the unique ambipolar conduction in graphene to reduce the offset and flicker noise in graphene-based Hall-effect sensor will be presented.",
	"bio" : "Arup Polley received B. Tech. degree in Electronics and Electrical Communication Engineering from Indian Institute of Technology, Kharagpur in 2003. He received M.S. degree in Electrical Engineering (2005) and Physics (2008), and a Ph. D. in Electrical Engineering (2008) from Georgia Institute of Technology, Atlanta.<br> <br> He joined the department of Electronic Systems Engineering, Indian Institute of Science, Bangalore as an Associate Professor in April 2021. From 2003 to 2008, he was a member of the Ultrafast Optical Communications Laboratory at the Georgia Institute of Technology, where he researched on holistic approaches for low-cost, high-speed multimode optical link involving co-development of transceiver and plastic optical fiber. In 2009, he joined the Storage Product Group at Texas Instruments, Dallas, where he developed advanced fly height sensing system for magnetic Hard Disk Drives. He joined Kilby Research Labs, Dallas of Texas Instruments in 2012, where he first developed a low-power sensor platform for wearable devices. Following that, he architected and developed wideband, low offset CMOS Hall-effect sensor system-on-chip for non-contact, magnetic-field-based, current-sensing applications. He also led TI’s internal and collaborative research with University of Texas at Dallas on graphene Hall-effect sensors. <br><br> He has authored and co-authored over 30 peer-reviewed journal and conference publications and holds 20 granted US patents. He is a senior member of IEEE."
}