{
	"title" : "Interference and Contention",
	"photo_link" : "photos/11._Franois_Baccelli.jpg",
	"speaker_link": "http://www.ece.utexas.edu/people/faculty/fran%C3%A7ois-baccelli",
	"speaker" : "F. Baccelli",
	"abstract" : "This talk features networks of coupled processor sharing queues in the Euclidean space, where customers arrive according to independent Poisson point processes at every queue, are served, and then leave the network. The coupling is through service rates. In any given queue, this rate is inversely proportional the interference seen by this queue,  which is determined by the load in neighboring queues, attenuated by some distance-based path-loss function.<br>The main focus is on the infinite grid network and translation invariant path-loss case.<br>The model is a discrete version of a spatial birth and death process where customers arrive to the Euclidean space according to Poisson rain and leave it when they have transferred an exponential file, assuming that the instantaneous rate of each transfer is determined through information theory by the signal to interference and noise ratio experienced by the user.<br>The stability condition is identified. The minimal stationary regime is built using coupling from the past techniques. The mean queue size of this minimal stationary regime is determined in closed form using the rate conservation principle of Palm calculus. When the stability condition holds, for all bounded initial conditions, there is weak convergence to this minimal stationary regime; however, there exist translation invariant initial conditions for which all queue sizes converge to infinity.<br>(Joint work with S. Foss and A. Sankararaman)",
	"bio" : "F. Baccelli's research directions are at the interface between Applied Mathematics and Communications. He is co-author of several research monographs on network mathematics: point processes and queues, max plus algebras and network dynamics, stationary queuing networks, stochastic geometry and wireless networks. He received the France Télécom Prize of the French Academy of Sciences in 2002, the Math+X Award of the Simons Foundation in 2012, and the ACM Sigmetrics Achievement Award in 2014. He also received the 2014 Rice Prize and the 2014 Abraham Prize Awards of the IEEE Communications Theory Society for his work on wireless network stochastic geometry. He is the Math+X chair in mathematics and ECE at UT Austin. He is a member of the French Academy of Sciences. He just started an ERC project on the mathematics of networks at INRIA."
}

