{
	"title" : "Modeling, Analysis, and Design of Distributed Algorithms for Wireless Networks",
	"photo_link" : "photos/17._Anurag_Kumar.jpg",
	"speaker_link": "https://ece.iisc.ac.in/~anurag/index.html",
	"speaker" : "Anurag Kumar",
	"abstract" : "This talk will present an overview of some results from our work in four broad areas of wireless networking, all of them being concerned with an aspect of distributed control in the context of wireless networks. (i) performance analysis of the CSMA/CA medium control, a contention-based, distributed algorithm that manages the sharing of the wireless medium in IEEE 802.11 (WiFi) networks; (ii) the design and deployment of multihop wireless networks, in which CSMA/CA is used as the distributed medium access control, the motivation being IEEE 802.15.4 based IoT networks; (iii) measurement-based sequential decision algorithms for as-you-go placement of nodes for multihop wireless networking, motivated by rapid deployment of networks in emergency situations; (iv) distributed control of content spread in a social network, where content popularity also spreads with time.",
	"bio" : "Anurag Kumar obtained his B.Tech. degree in Electrical Engineering from the Indian Institute of Technology at Kanpur in 1977, and was awarded the President of India's Gold Medal. He then obtained the PhD degree from Cornell University (1981), where he worked under the guidance of Prof. T.L. Fine. He was a Member of Technical Staff at AT&T Bell Labs, Holmdel, N.J., for over 6 years. During this period he worked on the performance analysis of computer systems, communication networks, and manufacturing systems. Since 1988 he has been with the Indian Institute of Science (IISc), Bangalore, in the Dept. of Electrical Communication Engineering (ECE), where he is a Professor, and is also currently the Director of IISc. From 2000 to 2004 he was the Associate Chair of the ECE Department, from 2004 to 2007 he was the Chair of the ECE Department, and from 2007 to 2014 he was the Chair of Electrical Sciences Division. From 1989 to 2003 he was also the Coordinator at IISc of the nationwide Education and Research Network (ERNET) Project, which established the first country-wide packet communication network in India.<br><br>He has served as an Area Editor for IEEE Transactions on Networking, and for IEEE Communications Surveys and Tutorials.<br><br>He has been elected a Fellow of the IEEE, a Fellow of the Indian National Science Academy (INSA), a Fellow of the Indian Academy of Science (IASc), a Fellow of the Indian National Academy of Engineering (INAE), and a Fellow of The World Academy of Sciences (TWAS). He received the IISc Alumni Award for Excellence in Engineering Research for 2008. He has been awarded the DST J.C. Bose National Fellowship for the period 2011-2021."
}

