{
	"title" : "Timeline Influence Analysis in Social Networks",
	"photo_link" : "photos/10._Eitan_Altman.jpg",
	"speaker_link": "https://www-sop.inria.fr/members/Eitan.Altman/",
	"speaker" : "Eitan Altman",
	"abstract" : "The major social networks use timelines to display content that a user receives from those sources that he follows. A content that arrives at a timeline is placed at the top of the list and each other content is pushed down by one step. If the timeline is finite (as in twitter) then this causes the last element in the timeline to be pushed out. Moreover, the lower the content is on the timeline the smaller its influence is. In this talk we shall first present analysis of the timeline process and of the probability to be visible on the timeline. We shall further describe the influence process of content which takes into account not only the location on the timeline but also aging of content. We shall finally introduce game theoretical models to describe the competition over popularity and over visibility of content in the timeline.",
	"bio" : "Eitan Altman received the B.Sc. degree in electrical engineering (1984), the B.A. degree in physics (1984) and the Ph.D. degree in electrical engineering (1990), all from the Technion-Israel Institute, Haifa. In 1990 he received his B.Mus. degree in music composition in Tel-Aviv university. Since 1990,Dr. Altman has been a researcher at INRIA (National research institute in computer science and control). He received the best paper award in the Networking 2006, in Globecom 2007, in IFIP Wireless Days 2009 and in CNSM 2011 (Paris) conferences. His areas of interest include Network Engineering Games, social networks and their 6control. He received in 2012 the Grand Prix de France Telecom from the French Academy of Sciences. On July 2014 he received the ISAACS Award from the Society of Dynamic Games for his contribution in game Theory. He received the Distinguished Technical Achievement Recognition Award by IEEE TC on Big Data (2017). More information can be found at www-sop.inria.fr/members/Eitan.Altman/"
}

