{
	"title" : "Nash equilibrium structure of Cox process Hotelling games",
	"photo_link" : "photos/2._Venkata_Anantharam.jpg",
	"speaker_link" : "https://www2.eecs.berkeley.edu/Faculty/Homepages/anantharam.html",
	"speaker" : "Venkat Anantharam",
	"abstract" : "We study an N-player game of Hotelling competition. Each player chooses a nonnegative intensity function subject to a finite constraint on its integral. The intensity represents the effort that the player puts in to capture different regions of the underlying space, and it results in a Poisson process of points on the space with the corresponding intensity. If the player uses a randomized strategy, its resulting point process would therefore be a Cox process. Players then capture regions corresponding to the Voronoi cells of their points, consistent with the traditional Hotelling competition model. The value received by a player is the total measure of the region it captures. We study the Nash equilibria of this game, when the underlying space is a compact complete separable metric measure space of finite measure. In the 2-player case, one motivation for such a formulation comes from a model for defense against threats. The underlying space may be thought of as a model for the set of possible attack modalities, with the metric indicating how similar attacks are to each other. The defender and the attacker are each interested in defending against or deploying the different kinds of attacks respectively, and the Voronoi cell capture feature evaluates how well each player is doing with regard to its individual objective of getting the upper hand over the other player. (Joint work with Francois Baccelli) ",
	"bio" : "Venkat Anantharam is on the faculty of the EECS department at U. C. Berkeley. He received his undergraduate degree from IIT Madras and his graduate degrees from U. C. Berkeley. From 1986 to 1994 he was on the faculty of the School of EE at Cornell University, before moving to U. C. Berkeley. His research work includes contributions to communication networking, stochastic control, game theory and information theory"
}
