{
	"title" : "Using Technology to Improve Healthcare",
	"photo_link" : "photos/8._Robert_Morris.jpg",
	"speaker_link": "https://www.linkedin.com/in/robertjtmorris/",
	"speaker" : "Robert Morris",
	"abstract" : "Achieving good outcomes in Healthcare is basically an \"information game\".  If you look at health systems as a network, we see that two of the most needed transformations are a \"shift-left\" and a \"shift up\" on that network,  i.e., we need to change the network routing.  We must understand how disease progresses, which is a machine learning problem, and then decide how to manage diseases in the population, which is an optimization problem, as there is always a limitation on resources.  Healthcare also a \"communications game\", because you have to find out how patients are doing when they aren't at a healthcare facility: besides telemedicine, this involves a new technique called \"digital phenotyping\".  I will illustrate these effects with ongoing work in Chronic Diseases, Mental Health and COVID-19.",
	"bio" : "Dr. Robert JT Morris is Professor, National University of Singapore Yong Loo Lin School of Medicine and Chief Technology Strategist for the Ministry of Health Transformation (MOHT). He is also an Advisor to the National Research Foundation in the Prime Minister’s Office. His current focus is on application of computer and information sciences, including AI, to transform healthcare.<br>From 2011-2017, he led all IBM Research’s Global Laboratories, and built new laboratories in Brazil, Australia, Africa and Singapore. IBM Research earned 6 Nobel prizes, laying the basis for the information revolution. In 2010 Fortune and Money Magazine declared Robert the “Smartest Scientist in Technology” in their print magazines and on the web https://ibm.biz/BdrbY4.<br>During 2006-2011, Robert was VP Services Research, IBM TJ Watson Research Center, NY, helping start IBM’s healthcare and IoT businesses, and earlier VP Assets Innovation, IBM Global Services. From 1999-2004, he was the VP & Director of IBM Almaden Research Center, Silicon Valley, where relational database technology, the disk drive, etc., were invented. Responsible for creation of Services Science, research for IBM’s ThinkPad, and Storage Systems. Earlier he led advanced systems research at TJ Watson Center, including the Deep Blue chess machine, which defeated world champion Garry Kasparov in 1997. Originally from Australia, he began his career at Bell Labs working on early neural networks and the largest packet switch of the era (2STP)."
}

